tap "beeftornado/rmtree"

if OS.mac?
  tap "jnsahaj/lumen"

  brew "awscli"
  brew "gpg"
  brew "hostess"
  brew "lumen"
  brew "pinentry-mac"
  brew "uutils-coreutils"
  brew "uutils-diffutils"
  brew "uutils-findutils"

  cask "1password-cli"
  cask "1password"
  cask "alt-tab"
  cask "android-platform-tools"
  cask "blip"
  cask "discord"
  cask "docker"
  cask "eqmac"
  cask "font-inter"
  cask "font-iosevka-nerd-font"
  cask "font-new-york"
  cask "font-sf-mono"
  cask "font-sf-pro"
  cask "ghostty"
  cask "git-credential-manager"
  cask "gitbutler"
  cask "gitkraken"
  cask "google-chrome"
  cask "google-drive"
  cask "iina"
  cask "jordanbaird-ice"
  cask "microsoft-auto-update"
  cask "microsoft-teams"
  cask "minisim"
  cask "raycast"
  cask "spotify"
  cask "transmission"
  cask "visual-studio-code"
  cask "whatsapp"
  cask "zed"
  cask "zen"

  mas "Blackmagic Disk Speed Test", id: 425264550
  mas "Xcode", id: 497799835
end

brew "atuin"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "helix"
brew "httpie"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "rm-improved"
brew "ouch"
brew "topgrade"
brew "zoxide"
