require "rbconfig"

tap "beeftornado/rmtree"

if RbConfig::CONFIG["host_os"] =~ /darwin/
  brew "gpg"
  brew "pinentry-mac"
  brew "uutils-coreutils"
  brew "uutils-diffutils"
  brew "uutils-findutils"

  cask "1password-cli"
  cask "1password"
  cask "blip"
  cask "dbeaver-community"
  cask "discord"
  cask "eqmac"
  cask "font-inter"
  cask "font-iosevka-nerd-font"
  cask "ghostty"
  cask "git-credential-manager"
  cask "gitkraken"
  cask "google-chrome"
  cask "google-drive"
  cask "microsoft-teams"
  cask "only-switch"
  cask "raycast"
  cask "slack"
  cask "spotify"
  cask "visual-studio-code"
  cask "whatsapp"
  cask "zed"

  # Rosetta 2 is required for some x86_64 applications
  cask "logitech-g-hub"
end

brew "atuin"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "helix"
brew "httpie"
brew "jq"
brew "lazydocker"
brew "mise"
brew "ripgrep"
brew "rm-improved"
brew "ouch"
brew "topgrade"
brew "zoxide"
