b4b4r07/enhancd
gazorby/fish-abbreviation-tips
jorgebucaran/autopair.fish
jorgebucaran/fisher
jorgebucaran/hydro
jorgebucaran/replay.fish
kidonng/vscode.fish
oh-my-fish/plugin-grc
wfxr/forgit
